In [1]:
import pandas as pd
import numpy as np

In [2]:
arr = [1,2,3,4,5]
s = pd.Series(arr, dtype = int)

In [3]:
s

0    1
1    2
2    3
3    4
4    5
dtype: int32

In [4]:
import pandas as pd

In [5]:
data = pd.read_csv('test.csv')

In [6]:
data

,User_ID,Product_ID,Gender,Age,Occupation,City_Category,Stay_In_Current_City_Years,Marital_Status,Product_Category_1,Product_Category_2,Product_Category_3
0,1000004,P00128942,M,46-50,7,B,2,1,1,11.0,NaN
1,1000009,P00113442,M,26-35,17,C,0,0,3,5.0,NaN
2,1000010,P00288442,F,36-45,1,B,4+,1,5,14.0,NaN
3,1000010,P00145342,F,36-45,1,B,4+,1,4,9.0,NaN
4,1000011,P00053842,F,26-35,1,C,1,0,4,5.0,12.0
...,...,...,...,...,...,...,...,...,...,...,...
233594,1006036,P00118942,F,26-35,15,B,4+,1,8,NaN,NaN
233595,1006036,P00254642,F,26-35,15,B,4+,1,5,8.0,NaN
233596,1006036,P00031842,F,26-35,15,B,4+,1,1,5.0,12.0
233597,1006037,P00124742,F,46-50,1,C,4+,0,10,16.0,NaN
233598,1006039,P00316642,F,46-50,0,B,4+,1,4,5.0,NaN

In [7]:
import pandas as pd

In [8]:
df = pd.read_excel('Sales_Data_Analysis.xlsx')
df

,Date,Product Name,Category,Sales Quantity,Unit Price,Total Sales,Region,Salesperson
0,2024-04-24,Smartphone,Electronics,3,369.55,1108.65,East,Bob
1,2024-01-16,Fiction,Books,2,113.23,226.46,West,Alice
2,2024-04-11,Science,Books,9,212.66,1913.94,North,Eleanor
3,2024-03-22,Doll,Toys,7,173.42,1213.94,East,Alice
4,2024-02-17,Jeans,Clothing,7,52.87,370.09,East,Alice
...,...,...,...,...,...,...,...,...
195,2024-12-07,Tablet,Electronics,5,27.48,137.40,West,Eleanor
196,2024-04-14,Doll,Toys,5,472.94,2364.70,North,Alice
197,2024-03-02,Jacket,Clothing,1,251.21,251.21,East,Catherine
198,2024-09-29,Action Figure,Toys,4,252.63,1010.52,South,David
199,2024-08-11,Microwave,Home Appliances,1,232.58,232.58,West,Alice

In [9]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 200 entries, 0 to 199
Data columns (total 8 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   Date            200 non-null    datetime64[ns]
 1   Product Name    200 non-null    object
 2   Category        200 non-null    object
 3   Sales Quantity  200 non-null    int64
 4   Unit Price      200 non-null    float64
 5   Total Sales     200 non-null    float64
 6   Region          200 non-null    object
 7   Salesperson     200 non-null    object
dtypes: datetime64[ns](1), float64(2), int64(1), object(4)
memory usage: 12.6+ KB

In [10]:
df.shape

(200, 8)

In [11]:
df.describe()

                      Date  Sales Quantity  Unit Price  Total Sales
count                  200      200.000000  200.000000   200.000000
mean   2024-06-26 02:31:12        5.425000  250.086600  1330.496550
min    2024-01-02 00:00:00        1.000000    6.610000     6.760000
25%    2024-03-21 18:00:00        3.000000  134.705000   430.050000
50%    2024-06-20 12:00:00        5.000000  251.455000  1096.905000
75%    2024-10-05 12:00:00        8.000000  373.150000  1897.425000
max    2024-12-27 00:00:00       10.000000  498.080000  4980.800000
std                    NaN        2.827428  141.439554  1114.824533

In [12]:
df.isnull().count()

Date              200
Product Name      200
Category          200
Sales Quantity    200
Unit Price        200
Total Sales       200
Region            200
Salesperson       200
dtype: int64

In [13]:
df.isna()

,Date,Product Name,Category,Sales Quantity,Unit Price,Total Sales,Region,Salesperson
0,False,False,False,False,False,False,False,False
1,False,False,False,False,False,False,False,False
2,False,False,False,False,False,False,False,False
3,False,False,False,False,False,False,False,False
4,False,False,False,False,False,False,False,False
...,...,...,...,...,...,...,...,...
195,False,False,False,False,False,False,False,False
196,False,False,False,False,False,False,False,False
197,False,False,False,False,False,False,False,False
198,False,False,False,False,False,False,False,False
199,False,False,False,False,False,False,False,False

In [14]:
df.isnull().sum()

Date              0
Product Name      0
Category          0
Sales Quantity    0
Unit Price        0
Total Sales       0
Region            0
Salesperson       0
dtype: int64

In [15]:
df.head()

,Date,Product Name,Category,Sales Quantity,Unit Price,Total Sales,Region,Salesperson
0,2024-04-24,Smartphone,Electronics,3,369.55,1108.65,East,Bob
1,2024-01-16,Fiction,Books,2,113.23,226.46,West,Alice
2,2024-04-11,Science,Books,9,212.66,1913.94,North,Eleanor
3,2024-03-22,Doll,Toys,7,173.42,1213.94,East,Alice
4,2024-02-17,Jeans,Clothing,7,52.87,370.09,East,Alice

In [16]:
df.tail()

,Date,Product Name,Category,Sales Quantity,Unit Price,Total Sales,Region,Salesperson
195,2024-12-07,Tablet,Electronics,5,27.48,137.40,West,Eleanor
196,2024-04-14,Doll,Toys,5,472.94,2364.70,North,Alice
197,2024-03-02,Jacket,Clothing,1,251.21,251.21,East,Catherine
198,2024-09-29,Action Figure,Toys,4,252.63,1010.52,South,David
199,2024-08-11,Microwave,Home Appliances,1,232.58,232.58,West,Alice

In [17]:
df.columns

Index(['Date', 'Product Name', 'Category', 'Sales Quantity', 'Unit Price',
       'Total Sales', 'Region', 'Salesperson'],
      dtype='object')

In [18]:
df.dtypes

Date              datetime64[ns]
Product Name              object
Category                  object
Sales Quantity             int64
Unit Price               float64
Total Sales              float64
Region                    object
Salesperson               object
dtype: object

In [19]:
df.value_counts

<bound method DataFrame.value_counts of           Date   Product Name         Category  Sales Quantity  Unit Price  \
0   2024-04-24     Smartphone      Electronics               3      369.55
1   2024-01-16        Fiction            Books               2      113.23
2   2024-04-11        Science            Books               9      212.66
3   2024-03-22           Doll             Toys               7      173.42
4   2024-02-17          Jeans         Clothing               7       52.87
..         ...            ...              ...             ...         ...
195 2024-12-07         Tablet      Electronics               5       27.48
196 2024-04-14           Doll             Toys               5      472.94
197 2024-03-02         Jacket         Clothing               1      251.21
198 2024-09-29  Action Figure             Toys               4      252.63
199 2024-08-11      Microwave  Home Appliances               1      232.58

     Total Sales Region Salesperson
0        1108.65   East         Bob
1         226.46   West       Alice
2        1913.94  North     Eleanor
3        1213.94   East       Alice
4         370.09   East       Alice
..           ...    ...         ...
195       137.40   West     Eleanor
196      2364.70  North       Alice
197       251.21   East   Catherine
198      1010.52  South       David
199       232.58   West       Alice

[200 rows x 8 columns]>

In [20]:
df.value_counts()

Date        Product Name  Category     Sales Quantity  Unit Price  Total Sales  Region  Salesperson
2024-01-02  Jacket        Clothing     5               429.91      2149.55      South   Eleanor        1
2024-08-31  Doll          Toys         8               390.12      3120.96      North   Alice          1
2024-08-19  Puzzle        Toys         2               127.71      255.42       West    Eleanor        1
2024-08-20  Non-fiction   Books        6               82.92       497.52       West    David          1
2024-08-21  Headphones    Electronics  1               362.61      362.61       North   Eleanor        1
                                                                                                      ..
2024-04-23  Headphones    Electronics  4               409.21      1636.84      North   David          1
2024-04-24  Lego Set      Toys         2               391.71      783.42       North   Catherine      1
            Non-fiction   Books        2               178.31      356.62       South   David          1
            Puzzle        Toys         1               331.72      331.72       East    Bob            1
2024-12-27  Jeans         Clothing     4               36.79       147.16       West    Bob            1
Name: count, Length: 200, dtype: int64

In [21]:
df['Region'].value_counts()

Region
East     57
North    56
West     50
South    37
Name: count, dtype: int64

In [22]:
df['Total Sales'].value_counts()

Total Sales
1108.65    1
1372.77    1
548.76     1
486.71     1
278.36     1
          ..
1748.04    1
368.24     1
461.90     1
1946.16    1
232.58     1
Name: count, Length: 200, dtype: int64

In [23]:
df[['Region', 'Salesperson', 'Total Sales']]

    Region Salesperson  Total Sales
0     East         Bob      1108.65
1     West       Alice       226.46
2    North     Eleanor      1913.94
3     East       Alice      1213.94
4     East       Alice       370.09
..     ...         ...          ...
195   West     Eleanor       137.40
196  North       Alice      2364.70
197   East   Catherine       251.21
198  South       David      1010.52
199   West       Alice       232.58

[200 rows x 3 columns]

In [24]:
df.loc['Salesperson']

KeyError: 'Salesperson'